food_list = {
    "Лазанья (классический рецепт)": {
        "Продукты (на 6 порций)\n" +
        "Листы для лазаньи - 250 г\n" +
        "Фарш мясной (говяжий) - 450 г\n" +
        "Лук репчатый - 1 шт.\n" +
        "Морковь - 1 шт.\n" +
        "Томатный соус - 60 г\n" +
        "Томатная паста - 60 г\n" +
        "Масло сливочное - 60 + 30 г\n" +
        "Мука - 60 г\n" +
        "Молоко - 800 мл\n" +
        "Сыр пармезан - 120 г\n" +
        "Соль - 2 ч. л.\n" +
        "Перец молотый - 1 ч. л."
    },

    "Паста карбонара с куриным филе": {
        "Продукты\n" +
        "Спагетти - 400 г\n" +
        "Куриное филе - 400 г\n" +
        "Бекон - 250 г\n" +
        "Желтки - 3 шт.\n" +
        "Сыр твердый - 50 г\n" +
        "Сливки - 200 мл\n" +
        "Масло растительное (для обжарки)\n" +
        "Соль - по вкусу\n" +
        "Перец черный молотый - по вкусу\n" +
        "Чеснок - 2 зубчика",
    },

    "Паста карбонара с беконом и сливками": {
        "Продукты (на 2 порции)\n" +
        "Паста сухая - 100 г\n" +
        "Бекон или панчетта - 80-100 г\n" +
        "Сыр пармезан - 50 г\n" +
        "Сливки 10-20% - 130 г\n" +
        "Перец черный\n" +
        "Яйцо - 2 шт.\n" +
        "Чеснок - по вкусу",
    },

    "Макароны по-флотски": {
        "Продукты (на 3 порции)\n" +
        "Макароны (перья с бороздками, спиральки и т.п.) - 225 г\n" +
        "Говядина - 275 г\n" +
        "Лук репчатый - 175 г\n" +
        "Масло сливочное - 50 г\n" +
        "Масло растительное - 3 ст. ложки\n" +
        "Соль - по вкусу\n" +
        "Перец чёрный молотый - по вкусу\n" +
        "Вода - 1,25 л",
    },

    "Спагетти Болоньезе": {
        "Продукты (на 4 порции)\n" +
        "Масло сливочное — 60 г\n" +
        "Лук репчатый, мелко нарезанный — 1 шт.\n" +
        "Чеснок раздавленный — 2 зубка\n" +
        "Стебель сельдерея, мелко нарезанный — 1 шт.\n" +
        "Морковь, нарезанная кубиками — 1 шт.\n" +
        "Панчетта (жирная свиная грудинка с пряностями) или копченая ветчина, нарезанная кубиками — 50 г\n" +
        "Говядина молотая — 500 г\n" +
        "Орегано нарезанная — 1 ст. л.\n" +
        "Вино сухое, красное — 1 стакан\n" +
        "Бульон мясной — 2 стакана\n" +
        "Томатная паста — 2 ст. л.\n" +
        "Помидоры консервированные (в томате), кусочками — 800 г\n" +
        "Соль, перец\n" +
        "Спагетти — 400 г\n" +
        "Сыр (желательно, Пармезан) тертый — 3 ст. л.",
    },

    "Макароны с тушенкой на сковороде": {
        "Макароны\n" +
        "Тушенка (одна банка)\n" +
        "Лук\n" +
        "Морковь\n" +
        "Соль\n" +
        "по вкусу",
    },

    "Запеканка \"Тимбаль\" из макарон, с мясным фаршем и грибами": {
        "Продукты (на 5 порций)\n" +
        "Букатини (или спагетти) – 200 г\n" +
        "Фарш свино-говяжий – 400 г\n" +
        "Фарш куриный – 300 г\n" +
        "Шампиньоны – 150-200 г\n" +
        "Лук репчатый – 130 г\n" +
        "Яйцо – 1 шт.\n" +
        "Томатный соус – 200 г\n" +
        "Масло сливочное – 30 г\n" +
        "Масло растительное – 20 мл\n" +
        "Зелень свежая (укроп и петрушка) – 10 г\n" +
        "Соль – по вкусу\n" +
        "Перец чёрный молотый – по вкусу",
    },

    "Японское карри": {
        "куриная грудка – 400 г;\n" +
        "картофель – 2 шт.\n" +
        "морковь – 1 шт.; \n" +
        "лук репчатый – 1 шт.; \n" +
        "чеснок – 2 зубчика; \n" +
        "порошок карри – 40 г; \n" +
        "мука – 2 ст.л.; \n" +
        "масло сливочное – 50 г; \n" +
        "вода – 1,5 л; \n" +
        "соль, перец.\n" +
        "рис – 370 г",
    },

    "Жареный рис с соевым соусом и яйцами": {
        "Продукты (на 3 порции)\n" +
        "Рис - 150 г\n" +
        "Яйца - 2 шт.\n" +
        "Соус соевый - 4 ст. ложки\n" +
        "Лук репчатый - 1 шт.\n" +
        "Чеснок - 2 зубчика\n" +
        "Перец чили - 0,5 шт. (или по вкусу)\n" +
        "Перец чёрный молотый - по вкусу\n" +
        "Масло растительное - 1 ст. ложка\n" +
        "Лимон (сок) - 1 ломтик\n" +
        "Лук зелёный (для подачи) - по вкусу",
    },

    "Плов, который всегда получается": {
        "Продукты\n" +
        "Мясо (курица, баранина и т.д.) - 1 кг\n" +
        "Рис (длиннозерный пропаренный или другой рис) - 1 кг\n" +
        "Морковь - 1 кг\n" +
        "Лук репчатый - 4 шт.\n" +
        "Чеснок - 2 головки\n" +
        "Перец острый свежий - 2 стручка\n" +
        "Зира или другие пряности - по вкусу\n" +
        "Соль - по вкусу\n" +
        "Масло растительное - 250-300 мл",
    },

    "Картофельная Запеканка \"Как в саду\"": {
        "Продукты\n" +
        "Картофель сырой, очищенный - примерно 800 г\n" +
        "Фарш мясной - 600 г\n" +
        "Лук репчатый (небольшой) - 2-3 шт.\n" +
        "Помидоры - 2 шт.\n" +
        "Перец болгарский - 1 шт.\n" +
        "Сыр твердый - 100 г\n" +
        "Яйцо куриное - 1 шт.\n" +
        "Молоко (по желанию) - для картофельного пюре\n" +
        "Масло сливочное - 10 г\n" +
        "Масло растительное - для обжарки\n" +
        "Соль - по вкусу\n" +
        "Перец - по вкусу\n" +
        "Зелень - по вкусу\n" +
        "Приправа для фарша - по вкусу",
    },

    "Жульен с курицей и грибами": {
        "Продукты (на 4 порции)\n" +
        "Филе куриное - 400 г\n" +
        "Грибы шампиньоны - 300 г\n" +
        "Лук репчатый - 100 г\n" +
        "Сливки 20-30% - 200 мл\n" +
        "Сыр твердый - 150 г\n" +
        "Масло растительное - 2 ст. ложки\n" +
        "Соль - по вкусу\n" +
        "Перец черный молотый - по вкусу\n" +
        "Зелень (базилик или салатные листья) - для украшения",
    },

    "Пицца на слоеном тесте": {
        "Продукты (на 2 порции)\n" +
        "Слоенное тесто\n" +
        "Помидоры\n" +
        "Колбаса\n" +
        "Сыр (можно несколько видов)\n" +
        "Остальное по вкусу\n",
    },

    "Квашеная капуста, тушенная с сосисками": {
        "Продукты (на 3 порции)\n" +
        "Капуста квашеная - 500 г\n" +
        "Сосиски - 300 г (4 шт.)\n" +
        "Лук репчатый - 70 г (1 некрупный)\n" +
        "Томатная паста - 2 ст. ложки\n" +
        "Соль - 1/5 ч. ложки\n" +
        "Перец чёрный молотый - 1 щепотка\n" +
        "Сахар - 1 ч. ложка\n" +
        "Масло растительное - 30 мл (2 ст. ложки)\n" +
        "*\n" +
        "Для подачи:\n" +
        "Укроп свежий - 2 веточки\n" +
        "Лук зелёный - 2 шт.",
    },

    "Запеканка из цветной капусты с куриным фаршем и помидорами": {
        "Продукты (на 4 порции)\n" +
        "Цветная капуста - 400 г (уже разобранная на соцветия, или небольшой кочан весом около 490 г)\n" +
        "Фарш куриный - 300 г\n" +
        "Помидоры - 180 г\n" +
        "Сыр твёрдый - 140 г\n" +
        "Сметана 20 % - 80 г\n" +
        "Яйца - 2 шт.\n" +
        "Масло подсолнечное - 40 мл\n" +
        "Паприка молотая - 0,5 ч. ложки\n" +
        "Приправа карри - 0,5 ч. ложки\n" +
        "Соль - по вкусу\n" +
        "Перец чёрный молотый - по вкусу",
    },

    "Овощное рагу": {
        "Продукты (на 2 порции)\n" +
        "Кабачки - 400 г\n" +
        "Картофель 3 шт\n" +
        "Морковь 1 шт\n" +
        "Перец болгарский - 250 г\n" +
        "Помидоры - 150 г\n" +
        "Лук репчатый - 130 г\n" +
        "Соль - 1 ч. ложка (или по вкусу)\n" +
        "Паприка копчёная молотая - 0,5 ч. ложки\n" +
        "Перец чёрный молотый - по вкусу\n" +
        "Петрушка свежая - 6 г",
    },

    "Болгарский перец, фаршированный мясом и рисом": {
        "Продукты\n" +
        "Перец болгарский некрупный - 17-19 шт.\n" +
        "Рис - 1 стакан\n" +
        "Фарш свино-говяжий - 1 кг\n" +
        "Морковь - 1-2 шт.\n" +
        "Лук репчатый - 2 шт.\n" +
        "Соль - 2 ч. ложки\n" +
        "Специи - 2 ч. ложки\n" +
        "Томат-паста - 1 ст. ложка\n" +
        "Сметана - 2 ст. ложки\n" +
        "Масло растительное - для жарки\n" +
        "Вода - 2 стакана",
    },

    "Макароны с сырным соусом": {
        "Продукты\n" +
        "Макароны - 400 г\n" +
        "Молоко - 1 л\n" +
        "Масло сливочное - 60 г\n" +
        "Мука - 50 г\n" +
        "Чеснок - 2-3 зубка\n" +
        "Сыр чеддер (или другой) - 100 г\n" +
        "Соль - 1 ч. ложка\n" +
        "Перец чёрный молотый или перец белый молотый - 0,5 ч. ложки\n" +
        "Орех мускатный - 1 щепотка",
    },

    "Ленивые голубцы в сковороде": {
        "Продукты\n" +
        "Капуста белокочанная – 250 г\n" +
        "Фарш мясной (домашний) – 300 г\n" +
        "Рис – 100 г\n" +
        "Морковь – 1 шт.\n" +
        "Лук репчатый – 1 шт.\n" +
        "Томатная паста – 1 ст. ложка\n" +
        "Вода – 200 мл\n" +
        "Масло растительное\n" +
        "Перец свежемолотый\n" +
        "Соль\n" +
        "*\n" +
        "Для подачи:\n" +
        "Сметана\n" +
        "Укроп свежий",
    },

    "Бифстроганов (из говядины)": {
        "Продукты\n" +
        "Говядина (у меня шейная часть) – 500 г\n" +
        "Лук репчатый – 1 шт.\n" +
        "Чеснок – 1 зубчик\n" +
        "Сметана 20% - 100 г\n" +
        "Кетчуп – 2-3 ст. ложки\n" +
        "(можно заменить томатной пастой – 0,5 ст. ложки)\n" +
        "Вода – 100 мл (регулируйте густоту подливки по своему вкусу)\n" +
        "Мука – 1 ст. ложка\n" +
        "Масло сливочное – 10-20 г\n" +
        "Масло растительное – для жарки\n" +
        "Лавровый лист – 1 шт.\n" +
        "Соль – 0,5 ч. ложки (по вкусу)\n" +
        "Перец черный молотый – по вкусу",
    },

    "Томатно-мясной соус из мяса": {
        "Говядина\n" +
        "Подсолнечное масло\n" +
        "Соль\n" +
        "Вода\n" +
        "Томатная паста\n" +
        "Душистый перец\n" +
        "Лук репчатый\n" +
        "Морковь",
    },

    "Свинина в кисло-сладком соусе": {
        "Продукты (на 4 порции)\n" +
        "Свинина - 450 г\n" +
        "Перец сладкий зеленый - 1 шт.\n" +
        "Перец красный сладкий - 1 шт.\n" +
        "Чеснок - 2 зубчика\n" +
        "Ананас консервированный - 200 г\n" +
        "Крахмал кукурузный - 50 г + 2 ч.л.\n" +
        "Мука пшеничная - 100 г\n" +
        "Разрыхлитель - 1 ч.л.\n" +
        "Масло растительное - 300 мл + 2 ст.л. (для обжаривания овощей)\n" +
        "Перец чили хлопья - 1/2 ч.л.\n" +
        "Перец черный молотый - 1/2 ч.л.\n" +
        "Сахар коричневый - 100 г\n" +
        "Уксус рисовый - 70 мл\n" +
        "Яйцо - 1 шт.\n" +
        "Кетчуп - 4 ст.л.\n" +
        "Соль - 2 ч.л.\n" +
        "Кунжут - для подачи",
    },

    "Гречка с овощами и тушенкой в духовке": {
        "Состав:\n" +
        "\n" +
        "гречка – 0,4 кг;\n" +
        "тушенка – 0,5 л;\n" +
        "рафинированное растительное или сливочное масло – сколько уйдет;\n" +
        "морковь – 100 г;\n" +
        "репчатый лук – 100 г;\n" +
        "сладкий перец – 0,2 кг;\n" +
        "томатная паста – 60 мл;\n" +
        "вода – 0,8 л;\n" +
        "соль, приправы – по вкусу.",
    },
}
